<h1> Юристы ЦЗПП помогли мне развестись без выезда на Родину. </h1>

<p> Я проживаю уже 3 года постоянно в Германии. Перед выездом из России, за год до даты выезда, я имел неосторожность жениться на человеке, который меня очень подвёл. В Германии я нашёл свою вторую половинку и решил оформить брак, но чтобы насолить мне моя первая жена постоянно ставила мне палки в колёса и мешала разводу. <p>

<p>Совершенно отчаявшись, я решил обратиться к юристу, чтобы он поспособствовал процедуре оформления развода.  Нашёл сайт ЦЗПП я по хорошим отзывам в Интернете и решил им, не задумываясь долго, позвонить.  Юрист ЦЗПП оказал мне грамотную и объёмную консультацию по телефону, ввиду того, что подъехать к ним в офис для меня было, сами понимаете, проблематично. Юрист попросил меня часть документов выслать почтой, а часть документов им в офис занесли мои родители, проживающие в Москве.</p>

<p>Без выезда в Россию, без моего присутствия в суде, юристы ЦЗПП, в достаточно короткие сроки развели меня с моей уже бывшей на данный момент  женой. Через некоторое время я смог заключить брак со своей нынешней женой в Германии, и мы очень счастливы, что наконец-то смогли официально оформить свои отношения.</p>

<p>Ни капли не жалею, что обратился именно к юристам ЦЗПП. Помогли! Спасибо!</p>

<p>С огромной признательностью, Рейдман Анатолий.</p>