<h1> В благодарность юристам ЦЗПП за то, что вернули моему сыну наследство погибшего отца! </h1>
<p>
    Этим отзывом я хочу выразить свою признательность юристам Центра защиты прав потребителей за их самоотверженный труд, позволивший мне сохранить наследство бывшего мужа для нашего сына.
</p>

<p>
    В нашей с сыном жизни случилась не так давно настоящая трагедия: в автомобильной аварии погиб его отец. С бывшим мужем мы давно не были вместе, расстались по обоюдному согласию, когда сыну было 4 года, но продолжали поддерживать хорошие отношения, совместно занимались  общим делом. Через какое-то время он женился во второй раз, в новой семье тоже появился ребенок. А в мае прошлого года он попал в ужасную аварию и не выжил... После того, как мы все попрощались с родным человеком, наступило время, как бы гадко это ни звучало, делить наследство. Естественно, никакого завещания не было, бывшему мужу было всего 42, никто не думал, что его жизнь так рано оборвется. Наследниками по закону являлись его вторая жена и оба его сына.  Когда мы обратились к нотариусу, чтобы оформить права на наследство, оказалось, что часть имущества мужа (в том числе и права на его фирму, которой мы фактически совместно занимались, но на бумаге он был её единоличным хозяином) каким-то чудесным образом оказалась переоформлена на его нынешнюю супругу, причем за считанные дни до его смерти. Заподозрив неладное, я попросила показать мне документы, подтверждающие то, что мой бывший муж подарил своей жене фирму и другое имущество. Оказалось, что «подарила» себе все она сама, действуя, якобы, по доверенности, а заверил документы её знакомый нотариус – бывший ухажер.
</p>

<p>
    Вот с такой запутанной проблемой я пришла в ЦЗПП. Не зная, что мне делать, я понимала, что найти правду поможет только очень хороший, опытный юрист, которого я нашла в вашей юридической фирме. Исковое заявление, которое составил мне юрист ЦЗПП, я подала в суд, а когда состоялось первое заседания, я поняла, что доверилась вам не напрасно. Суд признал договора недействительными. Как оказалось, сделку свою  эта женщина провернула уже после смерти мужа, а её нотариус сделал запись задним числом. Теперь им обоим предстоит понести наказание посерьезней.
</p>

<p>
    Не могу выразить всю свою благодарность вашим юристам за то, что они вернули моему сыну наследство погибшего отца! Мы всегда будем помнить то, что вы для нас сделали!
</p>

<p>
    Дементьева Лариса Павловна, бухгалтер
</p>