<h1> Благодаря вашим юристам моей фирме вернули долги! </h1>
<p>
    Уже больше 4 лет я занимаюсь предпринимательской деятельностью. Фирма моя небольшая, можно сказать, что семейный бизнес. Занимаемся ремонтом бытовых приборов, сантехники, и многого другого. Клиенты у нас разные: выполняем заказы и для рядовых граждан, и для других предприятий. Если с первыми расчет простой: работу выполнил – деньги получил, то другие иногда с уплатой затягивают, а иной раз и вовсе «забывают». Вот несколько клиентов набрали долгов на кругленькую сумму. Первые меры я сам принял: позвонил, напомнил. Несколько должников сразу деньги перечислили, а остальные опять на пару месяцев пропали.
</p>
<p>
    В ноябре обратился в вашу фирму за юридической помощью – нужна была консультация, потому что я не знал, какие шаги предпринять дальше. Ваш юрист попросил меня принести с собой все документы, которые показывали, какие услуги мы оказали должникам и на какие суммы. На основании этих данных он составил письма к каждому из должников, уведомил их о том, что у них есть долг перед моим предприятием. Еще в письмах юрист дал срок должникам, в течение которого они могли добровольно вернуть долг, иначе, как там говорилось, мы обратимся в суд. Из девяти моих должников шестеро отдали долг в течение двух недель после того, как мы отправили письма. А с оставшимися тремя нам пришлось встретиться в суде. Благодаря вашим юристам, которые составили для меня исковые заявления, помогли подготовиться к суду и руководили моими действиями на протяжении всего процесса, суд признал нашу правоту и в принудительном порядке взыскал с должников их долги. Эти суммы я теперь могу направить на расширение бизнеса, которое планировал давно.
</p>
<p>
    Позвольте выразить нашу благодарность специалистам вашего центра, знания и опыт которых помогли нам получить деньги, заработанные честным трудом! Успехов вам в дальнейшем!
</p>

<p>
    Иван Федорович Киселев, предприниматель.
</p>